#### Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.302515       NaN       NaN
1 -0.142408       NaN       NaN
2  1.051826       NaN -0.530145
3  0.979777       NaN  1.765613
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [17]:
df.dropna()

          0         1         2
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [18]:
df.dropna(thresh=3)

          0         1         2
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [19]:
df.fillna(0)

          0         1         2
0 -0.302515  0.000000  0.000000
1 -0.142408  0.000000  0.000000
2  1.051826  0.000000 -0.530145
3  0.979777  0.000000  1.765613
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.302515  0.500000  0.000000
1 -0.142408  0.500000  0.000000
2  1.051826  0.500000 -0.530145
3  0.979777  0.500000  1.765613
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [21]:
_ = df.fillna(0, inplace=True)

In [22]:
df

          0         1         2
0 -0.302515  0.000000  0.000000
1 -0.142408  0.000000  0.000000
2  1.051826  0.000000 -0.530145
3  0.979777  0.000000  1.765613
4 -0.320738 -0.512526 -1.466963
5 -0.742282 -0.507205 -1.275815
6  0.828865 -0.699649  0.922113

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.788237  0.579517  0.034522
1  1.154545 -1.316569  1.396626
2 -0.354872       NaN -0.206722
3 -0.838846       NaN -0.133211
4  0.574555       NaN       NaN
5 -2.852673       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0  0.788237  0.579517  0.034522
1  1.154545 -1.316569  1.396626
2 -0.354872 -1.316569 -0.206722
3 -0.838846 -1.316569 -0.133211
4  0.574555 -1.316569 -0.133211
5 -2.852673 -1.316569 -0.133211

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.788237  0.579517  0.034522
1  1.154545 -1.316569  1.396626
2 -0.354872 -1.316569 -0.206722
3 -0.838846 -1.316569 -0.133211
4  0.574555       NaN -0.133211
5 -2.852673       NaN -0.133211

In [26]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### Data Transformation

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [33]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [35]:
lowercased = data['food'].str.lower()

In [36]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)

In [38]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [40]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [45]:
transform = lambda x: x[:4].upper()

In [46]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(transform)

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [50]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [52]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)

In [56]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [57]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [58]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [59]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [60]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 11
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [61]:
group_names = ['Youth', 'YouthAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 11
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [62]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.75, 0.99], (0.51, 0.75], (0.26, 0.51], (0.017, 0.26], (0.017, 0.26], ..., (0.26, 0.51], (0.75, 0.99], (0.26, 0.51], (0.26, 0.51], (0.017, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.017, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [63]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.0379, 0.781], (-3.166, -0.629], (-3.166, -0.629], (-0.629, 0.0379], (-0.629, 0.0379], ..., (0.0379, 0.781], (0.781, 3.139], (-3.166, -0.629], (-0.629, 0.0379], (0.0379, 0.781]]
Length: 1000
Categories (4, interval[float64]): [(-3.166, -0.629] < (-0.629, 0.0379] < (0.0379, 0.781] < (0.781, 3.139]]

In [64]:
pd.value_counts(cats)

(0.781, 3.139]      250
(0.0379, 0.781]     250
(-0.629, 0.0379]    250
(-3.166, -0.629]    250
dtype: int64

In [65]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])
cats

[(0.0379, 1.355], (-3.166, -1.233], (-1.233, 0.0379], (-1.233, 0.0379], (-1.233, 0.0379], ..., (0.0379, 1.355], (1.355, 3.139], (-3.166, -1.233], (-1.233, 0.0379], (0.0379, 1.355]]
Length: 1000
Categories (4, interval[float64]): [(-3.166, -1.233] < (-1.233, 0.0379] < (0.0379, 1.355] < (1.355, 3.139]]

In [66]:
pd.value_counts(cats)

(0.0379, 1.355]     400
(-1.233, 0.0379]    400
(1.355, 3.139]      100
(-3.166, -1.233]    100
dtype: int64

In [67]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.053465    -0.040933     0.010867     0.005654
std       1.014078     0.983088     1.030016     0.990484
min      -3.839650    -2.874536    -3.715411    -3.196750
25%      -0.777335    -0.699684    -0.665071    -0.649284
50%      -0.078332    -0.021874     0.034003     0.006528
75%       0.618536     0.606489     0.714524     0.697101
max       2.895060     3.204479     3.952557     2.761837

In [68]:
col = data[2]
col[np.abs(col) > 3]

85    -3.715411
113   -3.162349
386    3.192627
712   -3.425361
886    3.952557
Name: 2, dtype: float64

In [69]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
85   0.207531  0.159418 -3.715411  0.370666
113 -1.271980 -0.585261 -3.162349 -0.353399
294 -3.839650 -0.393040 -0.994265 -0.245068
376 -0.654341  3.204479 -1.728565 -1.921456
386  0.397981  0.582909  3.192627  0.782479
619 -3.230459  0.320294 -0.337119 -0.027008
645 -3.294198 -2.051703 -1.840167 -0.577759
658 -0.202568 -0.361241 -0.076144 -3.196750
712  1.086987 -0.054461 -3.425361  1.471568
886  1.070715 -0.814540  3.952557 -1.326084

In [70]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [71]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052101    -0.041137     0.011025     0.005850
std       1.009682     0.982433     1.022037     0.989867
min      -3.000000    -2.874536    -3.000000    -3.000000
25%      -0.777335    -0.699684    -0.665071    -0.649284
50%      -0.078332    -0.021874     0.034003     0.006528
75%       0.618536     0.606489     0.714524     0.697101
max       2.895060     3.000000     3.000000     2.761837

In [72]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 0, 2])

In [73]:
df.iloc[sampler]

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [74]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [75]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [76]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
1    7
3    6
3    6
2   -1
3    6
0    5
2   -1
1    7
0    5
dtype: int64

In [77]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [78]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [79]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [80]:
mnames = ['movie_id', 'title', 'genres']

movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

movies[:10]

/home/trierbo/miniconda2/envs/ml-books/lib/python3.7/site-packages/ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [81]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [82]:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns=genres)

In [83]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [84]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [85]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [86]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [87]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [88]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [89]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

#### String Manipulation

In [90]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [91]:
pieces = [x.strip() for x in val.split(',')]

In [92]:
pieces

['a', 'b', 'guido']

In [93]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [94]:
'::'.join(pieces)

'a::b::guido'

In [95]:
'guido' in val

True

In [96]:
val.index(',')

1

In [97]:
val.find(':')

-1

In [99]:
val.count(',')

2

In [111]:
val = ' abababab '
val.count('abab')

2

In [112]:
val.strip()

'abababab'

In [113]:
val.rstrip()

' abababab'

In [114]:
val.lstrip()

'abababab '

In [117]:
val.ljust(12, '/')

' abababab //'

In [118]:
val.rjust(12, '/')

'// abababab '

In [119]:
import re

text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [120]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [121]:
regex.findall(text)

['    ', '\t ', '  \t']

In [162]:
text = """dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@gmail.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [163]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@gmail.com']

In [164]:
m = regex.search(text)
m

In [165]:
text[m.start():m.end()]

'dave@google.com'

In [170]:
m = regex.match(text)
text[m.start():m.end()]

'dave@google.com'

In [129]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [171]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [172]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [173]:
m = regex.match('wesm@bright.net')
m

In [174]:
m.groups()

('wesm', 'bright', 'net')

In [134]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'gmail', 'com')]

In [135]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: gmail, Suffix: com

In [175]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)

In [176]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [177]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [178]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [179]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [180]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [183]:
data.str.get()

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [154]:
data.str[:10]

Dave     dave@googl
Steve    steve@gmai
Rob      rob@gmail.
Wes             NaN
dtype: object